БухЭксп/InformationRegisters/CW_ЗакрытиеМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ЗакрытиеМониторинга</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ЗакрытиеМониторинга/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьДатуБлокировкиМониторинговыхПараметров(ОбъектМониторинга) Экспорт 
		
	Если Не ПолучитьФункциональнуюОпцию("CW_ИспользованиеБлокировкиМониторинга") Тогда
		Возврат Дата(1,1,1);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОбъектМониторинга) Тогда
		Возврат Дата(1,1,1);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CW_ЗакрытиеМониторинга.ДатаЗакрытия КАК ДатаЗакрытия
	|ИЗ
	|	РегистрСведений.CW_ЗакрытиеМониторинга КАК CW_ЗакрытиеМониторинга
	|ГДЕ
	|	CW_ЗакрытиеМониторинга.Аналитика = &ОбъектМониторинга";
	
	Запрос.УстановитьПараметр("ОбъектМониторинга", ОбъектМониторинга);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаЗакрытия;
	КонецЕсли;
	
	Возврат Дата(1,1,1);
		
КонецФункции

// Процедура - Записать данные блокировки мониторинговых параметров
//
// Параметры:
//  ОбъектМониторинга	 - 	 ОбъектМониторинга - Грузоперевозка или заказ 
//  СтрутураПараметров	 - 	 Структура с данными для записи.
//		- БлокировкаВключена 	- булево - признак вклчюения мониторинга в объекте
//		- ДатаБлокировки 		- Дата - Дата блокировки мониторинга
//
Процедура ЗаписатьДанныеБлокировкиМониторинговыхПараметров(ОбъектМониторинга, СтрутураПараметров) Экспорт
	
	ЗаписьРегистра = РегистрыСведений.CW_ЗакрытиеМониторинга.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Аналитика = ОбъектМониторинга;
	ЗаписьРегистра.Прочитать();
	
	Если НЕ СтрутураПараметров.БлокировкаВключена Тогда
		Если ЗаписьРегистра.Выбран() Тогда
			ЗаписьРегистра.Удалить();
		КонецЕсли;
	Иначе
		ЗаписьРегистра.Аналитика	= ОбъектМониторинга;
		ЗаписьРегистра.ДатаЗакрытия = СтрутураПараметров.ДатаБлокировки;
		ЗаписьРегистра.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры
	
#КонецЕсли
